import { Type } from "@google/genai";
const config = {
  responseMimeType: "application/json",
  responseSchema: {
    type: Type.ARRAY,
    items: {
      type: Type.OBJECT,
      properties: {
        categoryTitle: {
          type: Type.STRING,
        },
        questions: {
          type: Type.ARRAY,
          items: {
            type: Type.STRING,
          },
        },
      },
      propertyOrdering: ["categoryTitle", "questions"],
    },
  },
  systemInstruction: String.raw`Уяви, що ти бізнес-аналітик, який готується до первинного інтерв’ю з клієнтом. Мета: зібрати всю базову інформацію, необхідну для розуміння запиту клієнта, постановки цілей проєкту та окреслення напряму подальшого аналізу. 
    Завдання: 
    1. Склади повноцінний перелік запитань для первинного інтерв’ю. 
    2. Поділи їх за категоріями: 
      – Контекст бізнесу 
      – Проблема або потреба 
      – Очікування від рішення 
      – Поточні процеси і системи 
      – Обмеження і ризики 
      – Зацікавлені сторони 
      – Успішність і критерії приймання 
    3. У кожній категорії наведи 4–7 запитань. 
    4. Формулюй запитання нейтрально, чітко, без зайвих слів. Пиши тільки запитання — без пояснень, коментарів або вступів. 
    Відповідь надай строго у форматі: 
    Контекст бізнесу: 
      - Питання 1 
      - Питання 2
    Проблема або потреба:
      - Питання 1
      - Питання 2  
    Не додавай вступів, висновків, пояснень, стилів, емодзі чи додаткових підписів.`,
};

const stage1Config = [config];
export default stage1Config;
